app/controllers/posts_controller.rb

  def index
    #pp @template
    @posts = Post.all
---
SELECT * FROM "posts"